
Task 2
---------
1) Using ufo.csv dataset, extract Month from 'Time' and use it to create new column and call it 'IN_December', then it will have a value of '1' if the month is December and '0' otherwise.


2) Using ufo.csv dataset, create new column and call it 'Time_Diff_From_WW1' that have time difference in years from the 'Time' Column and World War 1 start date that is 'July 28, 1914'.

## 1

In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv('datasets/ufo.csv')
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [4]:
df['Time'] =  pd.to_datetime(df['Time'] , format = '%m/%d/%Y %H:%M' , errors = "coerce")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 712.7+ KB

In [5]:
df.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [6]:
df['Month_Name'] = df['Time'].dt.month_name()
df.head()

,City,Colors Reported,Shape Reported,State,Time,Month_Name
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,June
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,June
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,February
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,June
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,April

In [7]:
df['Month_Name'].value_counts()

June         3059
July         2345
August       1948
October      1723
September    1635
November     1509
May          1168
March        1096
April        1045
December     1034
January       862
February      817
Name: Month_Name, dtype: int64

In [8]:
def in_december(x):
    if x == 'December' : 
        return '1'
    else :
        return '0'

In [9]:
df['IN_December'] = df['Month_Name'].apply(in_december)
df.head()

,City,Colors Reported,Shape Reported,State,Time,Month_Name,IN_December
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,June,0
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,June,0
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,February,0
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,June,0
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,April,0

## 2) 
Using ufo.csv dataset, create new column and call it 'Time_Diff_From_WW1' that have time difference in years from the 'Time' Column and World War 1 start date that is 'July 28, 1914'.

In [10]:
from datetime import datetime

In [11]:
time_of_ww1 = datetime( 1914 ,7, 28)

In [12]:
df['Time_Diff_From_WW1'] =  (df['Time'] - time_of_ww1) / np.timedelta64(1, 'Y')

In [13]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Month_Name,IN_December,Time_Diff_From_WW1
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,June,0,15.846778
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,June,0,15.925949
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,February,0,16.554983
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,June,0,16.845087
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,April,0,18.726714